       DBD NAME=ORDRMR,ACCESS=(HDAM,OSAM),
               RMNAME=(DFSHDC40,2,5)
       DATASET DD1=ORDRMR,SIZE=2048

       SEGM NAME=XXORDER,PARENT=0,BYTES=8,PTR=(T)
       FIELD NAME=(ID,SEQ,U),BYTES=4,START=1,DATATYPE=INT
       FIELD NAME=ORDID,BYTES=4,START=5,DATATYPE=INT

       SEGM NAME=XXCUST,PARENT=XXORDER,BYTES=28,PTR=(T)
       FIELD NAME=(ID,SEQ,U),BYTES=4,START=1,DATATYPE=INT
       FIELD NAME=NAME,BYTES=24,START=5,TYPE=C

       SEGM NAME=XXPROD,PARENT=XXORDER,BYTES=34,PTR=(T)
       FIELD NAME=(ID,SEQ,U),BYTES=4,START=1,DATATYPE=INT
       FIELD NAME=NAME,BYTES=24,START=5,TYPE=C
       FIELD NAME=PRICE,BYTES=6,START=29,DATATYPE=DECIMAL(10,2)

       SEGM NAME=XXSTORE,PARENT=XXORDER,BYTES=24,PTR=(T)
       FIELD NAME=(ID,SEQ,U),BYTES=4,START=1,DATATYPE=INT
       FIELD NAME=NAME,BYTES=20,START=5,TYPE=C

       SEGM NAME=XXSALES,PARENT=XXSTORE,BYTES=24,PTR=(T)
       FIELD NAME=(ID,SEQ,U),BYTES=4,START=1,DATATYPE=INT
       FIELD NAME=NAME,BYTES=20,START=5,TYPE=C

       DBDGEN
       FINISH
       END
